--------------------------------------------------------------------
2017-07-16 18:48 发了新包，，，版本号2.0.7，更新内容：
1，工具条可以初始化控，
2，插入控件iframe尺寸调整，
3，修订模式的代码已经包含在内，

--------------------------------------------------------------------
2017-07-18 17:03 发了新包，，，版本号不变2.0.7，更新内容：
1，提供方法隐藏编辑器内容中的[]，再次点击即可显示[]；
2，右键添加选项，控制表格边线是否显示；

--------------------------------------------------------------------
（20170724 18:45）发了一个新jar ，版本号2.0.8，更新内容：
1，新增一个检查指标项与控件关联的新增接口
2，编辑器内容中，按钮的隐藏与显示的接口
3，上传图片时返回的图片url的前缀，需要根据当前项目名定义
4，编辑器打印出来的框框要去掉，
5，抽取js 中的css样式放到css文件

--------------------------------------------------------------------
（20170727 20.00）发新包了，版本号2.0.8。更新内容：
1，修复新增一个表格不能删除输入的文字bug
2，文字模板，
3，修订模式，实现将选中文字加删除线，再将"x"插进去，
4，重构，扩展工具条的方法，支持方法调用的同时支持触发事件；

--------------------------------------------------------------------
（20170804 0922）新发包了，版本号2.0.9，更新内容：
1、控件列表操作优化：控件列表中添加回车键搜索、双击选项实现确认插入
2、新增选值框（病案首页）
3、提供一个sde.接口，给没有填的字段设置标红样式，用来提醒医生该字段并未填(红点)
4、提供一个sde.checkNull()接口，进行空值检验，包括默认值(红框)

-------------------------------------------------------------------
（20170809 2042）新发包了，版本号2.0.9.1，更新内容：

1、病案首页下拉框接口：sde.setMRHPSelect();实现下拉框的值框起来
2、文本框自定义长度
3、初始化编辑器默认字体大小
4、

-------------------------------------------------------------------
（20170821 2035）新发包了，版本号2.0.9.4 ，更新内容：

1、修复粘贴下拉无法消失的问题
2、文本控件实现换行
3、修复input、文本域设值问题

-------------------------------------------------------------------
（20170905 17.00）新发包了，版本号2.0.9.6 ，更新内容：

1，修复控件【】括号能被删除的问题
2，下拉，
3，图片上传fastDFS，使用时在初始化前 window.UEDITOR_CONFIG.WEB_URL_FASTDFS="1";//FASTDFS服务配置----"1":启用fastDFS上传，"0":本地上传
4，添加控件报错的bug，已经发包，请@wiggin医疗事业部 测试一下是否修复。

-------------------------------------------------------------------
（20170918 17.00）新发包了，版本号2.0.9.7 ，更新内容：

1，Spring扫描两次的问题
2，新增一个控件检验接口：sdefun.checkPlugin();其中，该方法中调用了两个方法，checkPluginByVal（）和checkPluginByModel（），
调用sdefun.checkPlugin();后，看看页面是否有标红色的区域。说明那部分需要手动修复。

-------------------------------------------------------------------
（20170922 20.30）新发包了，版本号2.0.9.7.1 ，更新内容：

1，上传图片的大小限制改为20M，
2，二维码控件，
3，修复更新reportdata不成功的问题，
4，修复设置值input,textarea消失的问题，
5，包含了关联取数的select2.vop文件，如果要使用在sde.desigen中搜select.vop改为select2.vop即可；
-------------------------------------------------------------------
（20170926 20.30）新发包了，版本号2.0.9.7.2 ，更新内容：

1，修复input的系列问题，，
2，修复控件粘贴，直接清空控件值的问题，
3，换成sodiao新的底包：sde.editor2.js，，，，该文件的svn第一个版本为sodiao原文件,


-------------------------------------------------------------------
（20170929 11.30）新发包了，版本号2.0.9.8 ，更新内容：

1，上传tiff图片，支持fastDFS开关；
2，优化一个控件检验接口：sdefun.checkPlugin()；
3，修复jq加载失败的问题；
4，修复不支持上传tif格式图片的问题；


-------------------------------------------------------------------
（20171010 21.30）新发包了，版本号2.0.9.8.1 ，更新内容：

1，点击控件然后失去焦点，控件出现默认值，需要去掉，不能出现默认值。；
2，修复编辑控件后，pluginId和ver_id丢失的问题；
3，修复编辑器导致浏览器奔溃的问题；
4，修复校验接口中非text控件的contenteditable属性为true；



-------------------------------------------------------------------
（20171025 17.30）新发包了，版本号2.0.9.8.4-SNAPSHOT，更新内容：

1，修复mip项目的报告中，快捷键ctrl+z 能把设置的数据撤掉的问题；
2，修复控件内的文本拖拽导致浏览器崩溃的问题；
3，右键弹出框内容实现完全自定义；
4，contenteditable=false元素的内容，无法复制的问题；
5，上传视频中avi格式的转化flv，已经实现转换flv，但是还是不能播放；
6，单个病程可编辑、不可编辑的接口；



-------------------------------------------------------------------
（20171030 16.30）新发包了，版本号2.0.9.8.5-SNAPSHOT，更新内容：

1，修复控件第二次点击时无法选中控件输入框问题
2，优化旧接口校验，编辑器中已写好的控件值会丢失的问题
3，保证页面控件和数据源控件库版本一致的接口： sdefun.updatePluginByCode2Newest();；
5，上传视频中avi格式的转化mp4，保证能播放；
6，新增编辑器背景图、背景颜色功能；
7，删除控件内容后切换页面，再次点击该控件时，sde-value节点丢失的问题，修复了。
8，图片上传，格式转换后需要删除原图的问题，已经实现了。



-------------------------------------------------------------------
（20171030 16.30）新发包了，版本号2.1.0.20171127.12-SNAPSHOT，更新内容：

1，修复换行控件左移的问题
2，添加根据模板版本id获取最新的报告的接口sdefun.getNewestReportByTempVId()。
3，当控件没有默认值或者控件值为空时，显示描述（用于提示），
5，下拉控件增加键盘回车控制
6，控件管理页面
7，复制文字时去掉所带样式，采用编辑器的默认样式（增加F2键 切换粘贴模式）
8，增加控件标识的图标

-------------------------------------------------------------------
（20180123 12.30）新发包了，版本号2.1.0.20180123.12-SNAPSHOT，版本备份template_editor0123
更新内容：

1，联动功能
2，控件code不应该包含关键字，特殊字符
3，新增一个根据模板html将控件插入数据库的接口sde.insertPluginByHtml()
4，控件必填校验功能
5，控件里面的数据提交后排布不一致.原来是空格的,现在阻止默认事件,改成ensp(半个空格)
6，编辑器需要设置A5的宽度
7，子选项太多时，出现滚动条或者，可以搜索子选项
8，控件可以按一定规则计算。http://121.33.250.164:82/zentao/story-view-217.html
9，根据template表的content字段复制templatedate表数据.
10，更新template报告数据表的接口:updateTemplateData（）
11，编辑器控件code可以自定义校验规则
12，提供一个配置开关: window.SDE_CONFIG.ISSELECTORALL="1",
  1,保证sde.setControl()能设置多个控件.
  2,保证sde.getControl()能获取多个控件.
13，限制控件内容输入:
  1,可以判断(>,<等)数值或者指定XX控件值,控件无法继续输入.
    比如<10,即数据不能大于10,超出控件做出提示msg;又比如>=$code1,即数据不能大于code控件值,超出控件做出提示msg;.
  2,可以判断字数,做出xx限制.比如20(纯数字),即输入的最大字数为20;超出控件做出提示msg;
  3,可以正则判断,,做出xx限制.比如RegExp(/毛泽东XX/g),即输入的是否包含毛泽东XX;包含则控件做出提示msg;
14，多数据源接入

-------------------------------------------------------------------
   （20180201 15.00）新发包了，版本号2.1.0.20180201.15-SNAPSHOT，版本备份template_editor0201
更新内容：
1,修复隐藏控件括号还占字符得问题
2,规则取数,控件应该允许多选
3,增加超链接功能
4,控件分类树,修复当控件id不存在是显示默认的问题
5,控件内换行，保存之后换行效果消失
6,修复关联取数,左侧描述无法隐藏的问题.
7,修改新版pwp(3.1.0.20180131.18.release)多数据源读取序列号的逻辑:多数据源下,序列号读取本地的(读取规则:多数据源名转大写+原来序列号),插入数据是多数据源的表.
8,检验文本控件,需要对控件进行隐藏/显示,禁用/启用操作
(禅道编辑器迭代,主要修复694以下的问题)

未发布的新功能
-------------------------------------------------------------------
 版本号:       ，版本备份:       ，发包时间:       ，更新内容如下：
1.
2.